fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодсветитьСтрокиСПревышением();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПодсветитьСтрокиСПревышением();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ПодсветитьСтрокиСПревышением();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	Адрес = АнализГрафикаНаСервере();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", Адрес);
	СтруктураПараметров.Вставить("Год", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", СтруктураПараметров, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.Независимый)


КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодсветитьСтрокиСПревышением()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ТабЗнач = ДокОбъект.ОтпускаСотрудников.Выгрузить();
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ТабЗнач",  ТабЗнач);
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТабЗнач.Сотрудник,
	|	ТабЗнач.ДатаНачала,
	|	ТабЗнач.ДатаОкончания,
	|	РАЗНОСТЬДАТ(ТабЗнач.ДатаНачала, ТабЗнач.ДатаОкончания, День) + 1 КАК КоличествоДней,
	|	ТабЗнач.НомерСтроки
	|ПОМЕСТИТЬ ВТ_РасчетДней
	|ИЗ
	|	&ТабЗнач КАК ТабЗнач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетДней.Сотрудник,
	|	СУММА(ВТ_РасчетДней.КоличествоДней) КАК КоличествоДней
	|ПОМЕСТИТЬ ВТ_ОбщееКоличествоДнейСотрудника
	|ИЗ
	|	ВТ_РасчетДней КАК ВТ_РасчетДней
	|ГДЕ
	|	ВТ_РасчетДней.КоличествоДней > 28
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетДней.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбщееКоличествоДнейСотрудника.Сотрудник,
	|	ВТ_ОбщееКоличествоДнейСотрудника.КоличествоДней,
	|	ВТ_РасчетДней.НомерСтроки
	|ИЗ
	|	ВТ_ОбщееКоличествоДнейСотрудника КАК ВТ_ОбщееКоличествоДнейСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетДней КАК ВТ_РасчетДней
	|		ПО ВТ_РасчетДней.Сотрудник = ВТ_ОбщееКоличествоДнейСотрудника.Сотрудник";
		

	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	

	
	УсловноеОформление.Элементы.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			

		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	    ЭлементОформления.Использование = Истина;
	    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоКоралловый);
	    
	    ЭлементОтбора                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.НомерСтроки");
	    ЭлементОтбора.ПравоеЗначение = ВыборкаДетальныеЗаписи.НомерСтроки;
	    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
	    ЭлементОтбора.Использование  = Истина;
	    
	    ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
    	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
    	ОформляемоеПоле.Использование = Истина;
	    
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ТабЗнач = ДокОбъект.ОтпускаСотрудников.Выгрузить();
	
	Адрес = ПоместитьВоВременноеХранилище(ТабЗнач, Новый УникальныйИдентификатор);
	
	Возврат Адрес;
	
КонецФункции
	

#КонецОбласти
